"""
python里面各种运算符
"""
# 算术（数学）运算符
print("算术（数学）运算符")
print("1+1=",1+1)       #加法
print("10-3=",10-3)     #减法
print("2*4=",2*4)       #乘法
print("16/2=",16/2)     #除法
print("16%3=",16%3)     #取余
print("100**2=",100**2) #开方
print("10//3=",100//3)  #整除
 

print("\n")
# 赋值运算符 
print("赋值运算符")
a=3
c=6
    # 1.加法赋值运算
c+=a   #等于 c=c+a
print("1.   c+=a 运算结果：",c)


    # 2.减法赋值运算
c-=a   #等于 c=c-a
print("2.   c-=a 运算结果：",c)


    # 3.乘法赋值运算
c*=a  #等于  c=c*a
print("3.   c*=a 运算结果：",c)


    # 4.除法赋值运算
c/=a  #等于  c=c/a
print("4.   c/=a 运算结果：",c)


    # 5.取余赋值运算
c%=a  #等于  c=c%a
print("5.   c%=a 运算结果：",c)


    # 6.幂赋值运算
a=3
c=6
c**=a  #等于  c=c**a
print("6.   c**=a 运算结果：",c) 


    # 7.取整赋值运算
c//=a #等于     c=c//a
print("7.   c//=a 运算结果：",c)


