year = 2020  # 定义年份变量，值为2020
month = 2  # 定义月份变量，值为2

# 判断月份是否为1、3、5、7、8、10或12
if month in [1, 3, 5, 7, 8, 10, 12]:
    print("%d月有31天" % month)  # 如果月份是这些值之一，则输出该月份有31天

# 判断月份是否为4、6、9或11
elif month in [4, 6, 9, 11]:
    print("%d月有30天" % month)  # 如果月份是这些值之一，则输出该月份有30天

# 判断月份是否为2
elif month == 2:
    # 判断年份是否为闰年
    if year % 400 == 0 or year % 4 == 0 and year % 100 != 0:
        print("%d年%d月有29天" % (year, month))  # 如果年份是闰年，则输出该月份有29天
    else:
        print("%d年%d月有28天" % (year, month))  # 如果年份不是闰年，则输出该月份有28天
